In [1]:
import numpy as np 
import pandas as pd
import matplotlib.pyplot as plt
import pickle

In [2]:
#Import data set
dataset = pd.read_csv("dataset/hiring.csv")

In [3]:
#View the dataset
dataset.head()

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000

In [6]:
dataset.dtypes

experience                     object
test_score(out of 10)         float64
interview_score(out of 10)      int64
salary($)                       int64
dtype: object

In [4]:
#Check missing values
dataset.isna().sum()

experience                    2
test_score(out of 10)         1
interview_score(out of 10)    0
salary($)                     0
dtype: int64

In [10]:
dataset['test_score(out of 10)'].mean()

7.857142857142857

In [12]:
#dealing with missing values
dataset['experience'].fillna(0, inplace=True)
dataset['test_score(out of 10)'].fillna(dataset['test_score(out of 10)'].mean(), inplace=True)

In [13]:
dataset.isna().sum()

experience                    0
test_score(out of 10)         0
interview_score(out of 10)    0
salary($)                     0
dtype: int64

In [14]:
dataset['experience']

0         0
1         0
2      five
3       two
4     seven
5     three
6       ten
7    eleven
Name: experience, dtype: object

In [23]:
#converting words into integer values
#We define a function to do that
def converting_words_integer (word):
    word_dict = {'one': 1, 'two': 2, 'three':3, 'four':4,
                 'five':5, 'six':6, 'seven':7, 'eight':8,
                 'nine':9, 'ten':10, 'eleven':11, 'zero':0, 0: 0}
    return word_dict[word]

In [24]:
x = dataset.iloc[:,:3]
x

  experience  test_score(out of 10)  interview_score(out of 10)
0          0               8.000000                           9
1          0               8.000000                           6
2       five               6.000000                           7
3        two              10.000000                          10
4      seven               9.000000                           6
5      three               7.000000                          10
6        ten               7.857143                           7
7     eleven               7.000000                           8

In [25]:
#apply the function using lambda
x['experience']=x['experience'].apply(lambda x: converting_words_integer(x))

In [26]:
y = dataset.iloc[:,-1]
y

0    50000
1    45000
2    60000
3    65000
4    70000
5    62000
6    72000
7    80000
Name: salary($), dtype: int64

In [29]:
#train the model
from sklearn.linear_model import LinearRegression
regressor = LinearRegression()
#fit the model
regressor.fit(x, y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=1, normalize=False)

In [31]:
#save the model
pickle.dump(regressor, open('model.pkl', 'wb'))

In [32]:
#loading the saved model to compare the results
model = pickle.load(open('model.pkl','rb'))
print(model.predict([[2,9,6]]))

[53290.89255945]